app/controllers/store_controller.rb

  def index
    @products = Product.find_products_for_sale
---
SELECT * FROM `products` ORDER BY title

  def add_to_cart
    product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 2)

  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO `line_items` (`created_at`, `product_id`, `quantity`, `order_id`, `total_price`, `updated_at`) VALUES('2010-02-17 12:25:46', 2, 2, 1, 59, '2010-02-17 12:25:46')
INSERT INTO `orders` (`name`, `address`, `created_at`, `updated_at`, `pay_type`, `email`) VALUES('foo Bar', '1,foobar', '2010-02-17 12:25:46', '2010-02-17 12:25:46', 'check', 'foobar@foobar.net')